In [ ]:
# Data enginieering cheatsheet

In [ ]:
# Tags
EDA

# References

In [ ]:
[Data enginieering cheatsheet](https://medium.com/geekculture/the-basics-of-a-jupyter-notebook-pandas-cheat-sheet-for-data-engineers-c1099791a93c)

In [5]:
import pandas as pd
import numpy as np

In [2]:
# Load data
df = pd.read_csv('data/IMDB_Movie_Data.csv' ,sep=",")

In [4]:
# export df in a csv
df.to_csv('data/my_data.csv', index=False, header=True)

In [ ]:
## TOC:
* [Exploring data](#explore-bullet)
* [Statistics](#statistics-bullet)
* [Import data](#import-bullet)
* [Export data](#export-bullet)
* [Column Manipulation](#column-bullet)
* [String Manipulation](#string-bullet)
* [Date Manipulation](#date-bullet)
* [Sorting](#sorting-bullet)
* [Row Manipulation](#row-bullet)
* [Table groupby](#groupby-bullet)
* [Table pivot](#pivot-bullet)
* [Table join](#join-bullet)
* [Table transform](#transform-bullet)
* [Concatenate](#concatenate-bullet)

In [ ]:
# Exploring data

In [ ]:
## Exploring data <a class="anchor" id="explore-bullet"></a>

In [ ]:
df.head()
df.tail()
df.sample(5)
df.shape
df.describe()
df.info()

# Statistics

## Statistics <a class="anchor" id="statistics-bullet"></a>

In [ ]:
df.describe()
df.mean()
df.corr()
df.count()
df.max()
df.min()
df.median()
df.std()

In [ ]:
# Import data from file

In [ ]:
## Import data <a class="anchor" id="import-bullet"></a>

In [ ]:
# from csv
df = pd.read_csv('data/my_data.csv' ,sep=",")

# from excel
df = pd.read_excel('data/my_data.xlsx' ,sheetname='sheet1', skiprows=[1])

In [ ]:
## Export data <a class="anchor" id="export-bullet"></a>

In [ ]:
# export df in a csv
df.to_csv('data/my_data.csv', index=False, header=True)

# export df to excel
df.to_excel('data/my_data.xlsx')

## Column Manipulation <a class="anchor" id="column-bullet"></a>

In [ ]:
df[['Title', 'Rating']]
df.filter(['Title', 'Rating'])

# Column Rename

In [ ]:
df.rename(columns={'Title':'a', 'Rating':'b'}, inplace=True)
df.rename(columns={'a':'Title', 'b':'Rating'}, inplace=True)

# Column Reorder

In [ ]:
# show column values
df.columns.values

# reorder
df[['Title', ....]]

# Adding a new column

In [ ]:
df['new column'] = 23
df['Rating_Votes'] = df.Rating + df.Votes

# Changing the type of the column

In [ ]:
df['Year_str'] = df['Year'].astype(str)
df['Year_int'] = df['Year_str'].astype(int)

# Double to int
df['Rating_int'] = df['Rating'].round(0).astype(int)

## String Manipulation <a class="anchor" id="string-bullet"></a>

In [ ]:
df['Title_lower'] = df['Title'].str.lower()
df['Title_upper'] = df['Title'].str.upper()
df['Title_len'] = df['Title'].str.len()

# first word
df['Title_first_word'] = df['Title'].str.split('')[0]

# find word 'Squad' in the title
df['Title_squad'] = df['Title'].str.find('Squad', 0)

# check python string format

In [ ]:
# x/x/xxxx xx:xx

import re
r = re.compile('.*/.*/.*:.*')
if r.match('x/x/xxxx xx:xx') is not None:
   print 'matches'

## Date Manipulation <a class="anchor" id="date-bullet"></a>

In [ ]:
pd.to_datetime('2020/10/13')

## Sorting <a class="anchor" id="sorting-bullet"></a>

In [ ]:
df.sort_values(by='Title', ascending=True)
df.sort_values(by=['Title', 'Year'], ascending=True)

## Row Manipulation <a class="anchor" id="row-bullet"></a>

In [ ]:
df[df.Title == 'Prometheus']
df[(df.Year == 1998 ) & (df.Rating > 8.5)]
titel = ['Prometheus', 'Song', 'Guardians of the Galaxy']
df[df.Title.isin(titel)]
# select rows 1:3
df.iloc[0:3]
# first 4 rows and first 2 columns
df.iloc[0:4, 0:3]

## Table groupby <a class="anchor" id="groupby-bullet"></a>

In [ ]:
# nr of titles per year
df.groupby('Year')['Title'].count().to_frame()

# nr of titles per year and per director
df.groupby(['Year', 'Director'])['Title'].count().to_frame()

# Rating mean per Director
df.groupby('Director')['Rating'].mean().to_frame().rest_index()

# combination of different groups per functions

df.groupby(['Year', 'Director']).agg(
    {'Title':"count", # nr of titles per year and per director
     'Rating':"mean", # mean Rating per year and per director
     'Revenue (Millions)': "sum", # sum of revenue per year and per director
    }).reset_index()

## Table pivot <a class="anchor" id="pivot-bullet"></a>

In [ ]:
# pivot over Director and mean over other columns
pd.pivot_table(df, index=['Director']).reset_index()

# pivot with sum
pd.pivot_table(df, index=['Director', 'Year'], values = ['Revenue (Millions)'], aggfunc=np.sum).reset_index()

# unpivot over years
pd.pivot_table(df, values = ['Rating'], columns =['Year']).reset_index()

df.melt(id_vars=['index'], var_name= 'Year', value_name='Title')

In [4]:
# unpivot over years
pd.pivot_table(df, values = ['Rating'], columns =['Year']).reset_index()

Year,index,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,Rating,7.125,7.133962,6.784615,6.960784,6.826667,6.838095,6.925,6.812088,6.837755,6.602362,6.4367

## Table join <a class="anchor" id="join-bullet"></a>

In [ ]:
# create new dataframe df_dir_movies
df_dir_movies = df.groupby(["Director"])["Title"].count().to_frame(name = 'number of movies').reset_index()
    
# create new dataframe df_dir_rev
df_dir_rev = df.groupby(["Director"])["Revenue (Millions)"].sum().to_frame(name = 'Revenue').reset_index()

# join the dataframe df_dir_movies with df_dir_rev
# how = rigtht, left, inner or outer

pd.merge(df_dir_movies,df_dir_rev, left_on=['Director'], right_on=['Director'],how = 'left')

## Table transform <a class="anchor" id="transform-bullet"></a>

In [ ]:
# pd.transform(func, axis=0) 0-column, 1-row

In [6]:
df = pd.DataFrame({'A': [1,2,3], 'B': [10,20,30] })
df

   A   B
0  1  10
1  2  20
2  3  30

In [9]:
# 1. apply a function to a df
def plus_10(x):
    return x+10
df.transform(plus_10)

    A   B
0  11  20
1  12  30
2  13  40

In [10]:
# 2. apply a lambda function
df.transform(lambda x: x+10)

    A   B
0  11  20
1  12  30
2  13  40

In [11]:
# 3. apply transformation by passi a valid function as a string
df.transform('sqrt')

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226

In [16]:
# 4. apply a list of functions
df.transform([np.sqrt, np.exp])

          A                    B
       sqrt        exp      sqrt           exp
0  1.000000   2.718282  3.162278  2.202647e+04
1  1.414214   7.389056  4.472136  4.851652e+08
2  1.732051  20.085537  5.477226  1.068647e+13

In [17]:
# 5. apply a dict to columns
df.transform({
    'A': np.sqrt,
    'B': np.exp,
})

          A             B
0  1.000000  2.202647e+04
1  1.414214  4.851652e+08
2  1.732051  1.068647e+13

In [19]:
# 6. Combining groupby results
df = pd.DataFrame({
  'restaurant_id': [101,102,103,104,105,106,107],
  'address': ['A','B','C','D', 'E', 'F', 'G'],
  'city': ['London','London','London','Oxford','Oxford', 'Durham', 'Durham'],
  'sales': [10,500,48,12,21,22,14]
})
df
# We can see that each city has multiple restaurants with sales.

   restaurant_id address    city  sales
0            101       A  London     10
1            102       B  London    500
2            103       C  London     48
3            104       D  Oxford     12
4            105       E  Oxford     21
5            106       F  Durham     22
6            107       G  Durham     14

In [24]:
# We would like to know “What is the percentage of sales each restaurant represents in the city”. 
df['city_total_sales'] = df.groupby('city')['sales']\
                           .transform('sum')

df['pct'] = df['sales'] / df['city_total_sales']
df['pct'] = df['pct'].apply(lambda x: format(x, '.2%'))
df

   restaurant_id address    city  sales  city_total_sales     pct
0            101       A  London     10               558   1.79%
1            102       B  London    500               558  89.61%
2            103       C  London     48               558   8.60%
3            104       D  Oxford     12                33  36.36%
4            105       E  Oxford     21                33  63.64%
5            106       F  Durham     22                36  61.11%
6            107       G  Durham     14                36  38.89%

In [25]:
# 7. Filtering data
df[df.groupby('city')['sales'].transform('sum') > 40]

   restaurant_id address    city  sales  city_total_sales     pct
0            101       A  London     10               558   1.79%
1            102       B  London    500               558  89.61%
2            103       C  London     48               558   8.60%

In [27]:
# 8. Handling missing values at group level
df = pd.DataFrame({
    'name': ['A', 'A', 'B', 'B', 'B', 'C', 'C', 'C'],
    'value': [1, np.nan, np.nan, 2, 8, 2, np.nan, 3]
})
df

  name  value
0    A    1.0
1    A    NaN
2    B    NaN
3    B    2.0
4    B    8.0
5    C    2.0
6    C    NaN
7    C    3.0

In [29]:
df['value'] = df.groupby('name')\
                .transform(lambda x: x.fillna(x.mean()))
df

  name  value
0    A    1.0
1    A    1.0
2    B    5.0
3    B    2.0
4    B    8.0
5    C    2.0
6    C    2.5
7    C    3.0

## Concatenate <a class="anchor" id="concatenate-bullet"></a>

In [ ]:
df.append(df2) # Append df2 to df (The columns must be the same in both dataframes)